#include "prelude.h"

#include "proc.h"
#include "hardware.h"
#include "bm.h"
#include "m4a.h"
#include "text.h"
#include "gbaio.h"
#include "face.h"
#include "util.h"
#include "sound.h"
#include "oam.h"
#include "save_menu.h"
#include "gbasvc.h"
#include "sprite.h"
#include "banim_sprite.h"
#include "ui.h"

extern u8 gUnk_02000000;
extern u8 gUnk_02000001;

struct ModeSelectProc
{
    /* 00 */ PROC_HEADER;
    /* 2C */ i32 timer;
    /* 30 */ u16 unk_30;
    /* 32 */ u16 unk_32;
    /* 34 */ i32 unk_34;
    /* 38 */ STRUCT_PAD(0x38, 0x3c);
    /* 3C */ Proc * face_proc;
    /* 40 */ u8 unk_40;
    /* 41 */ u8 unk_41;
    /* 42 */ u8 unk_42;
    /* 43 */ u8 selected_difficulty[3];
    /* 46 */ STRUCT_PAD(0x46, 0x49);
    /* 49 */ u8 unk_49[3];
    /* 4C */ u8 unk_4c;
    /* 50 */ i32 unk_50;
};

struct ModeSelectSpriteDrawProc
{
    /* 00 */ PROC_HEADER;
    /* 2C */ i32 unk_2c;
    /* 30 */ i32 unk_30;
    /* 34 */ i32 unk_34;
    /* 38 */ i32 unk_38;
    /* 3C */ u8 unk_3c;
    /* 3E */ u16 unk_3e;
    /* 40 */ i32 unk_40;
    /* 44 */ i32 unk_44;
    /* 48 */ i32 unk_48;
    /* 4C */ u8 unk_4c;
    /* 4D */ u8 unk_4d;
    /* 4E */ u8 unk_4e;
};

// sprites
extern u16 gUnk_08CE483C[]; // sprite
extern u16 gUnk_08CE4856[];
extern u16 gUnk_08CE487C[];
extern u16 gUnk_08CE489C[];
extern u16 gUnk_08CE48A4[];

struct AnimInterpretBuf
{
    /* 00 */ u8 unk_00;
    /* 01 */ u8 generic_pal_id;
    /* 02 */ u16 x;
    /* 04 */ u16 y;
    /* 06 */ u16 anim_id;
    /* 08 */ u16 char_pal_id;
    /* 0A */ u16 unk_0A;
    /* 0C */ u16 unk_0C;
    /* 0E */ u16 tile_offset;
    /* 10 */ u16 pal_offset;
    /* 14 */ struct BanimSprite * anim_a;
    /* 18 */ struct BanimSprite * anim_b;
    /* 1C */ void * sheet;
    /* 20 */ void * pal;
    /* 24 */ void * unk_24;
    /* 28 */ void * frame_data;
    /* 2C */ void * sheet_pointer;
    /* 30 */ void * magic_effect; // AnimMagicEffectBuf
    /* 34 */ Proc * unk_34;
};

extern struct AnimInterpretBuf gUnk_0201E8D4[];

struct AnimMagicEffectBuf
{
    u16 unk_00;
    u16 unk_02;
    u16 unk_04;
    u16 unk_06;
    u16 unk_08;
    u16 unk_0A;
    u16 unk_0C;
    u16 unk_0E;
    u16 unk_10;
    u16 unk_12;
    int unk_14;
    int unk_18;
    void * unk_1C;
    void * unk_20;
    void * unk_24;
};

// banim.h
void func_08054C8C(struct AnimInterpretBuf *);
void func_08054E10(struct AnimInterpretBuf *, i16, i16);
void func_08054E5C(struct AnimInterpretBuf *);
void func_08054EA8(void); // EndEkrAnimeDrvProc
void func_08054EC8(void *);
void func_08054EF0(void *);

extern struct AnimMagicEffectBuf gUnk_0201E97C[];

i32 func_0809E9FC(void);

void func_080A73F8(i32);

i32 func_080A86A0(i32, i32, i32, i32, i32);
void func_080A8D98(i32);
void func_080A9DE8(i32, i16, i32, i32, i32, i32);
void func_080A9E7C(i32, i32, i32);
void func_080A9ECC(i32, i16, i16, i32, i32);

extern u16 gUnk_0201E9F4[];

struct Unk_020000A4
{
